# Mandatory Challenge
## Context
You work in the data analysis team of a very important company. On Monday, the company shares some good news with you: you just got hired by a major retail company! So, let's get prepared for a huge amount of work!

Then you get to work with your team and define the following tasks to perform:   
1. You need to start your analysis using data from the past.  
2. You need to define a process that takes your daily data as an input and integrates it.  

You are in charge of the second part, so you are provided with a sample file that you will have to read daily. To complete you task, you need the following aggregates:
* One aggregate per store that adds up the rest of the values.
* One aggregate per item that adds up the rest of the values.

You can import the dataset `retail_sales` from Ironhack's database. 

## Your task
Therefore, your process will consist of the following steps:
1. Read the sample file that a daily process will save in your folder. 
2. Clean up the data.
3. Create the aggregates.
4. Write three tables in your local database: 
    - A table for the cleaned data.
    - A table for the aggregate per store.
    - A table for the aggregate per item.

## Instructions
* Read the csv you can find in Ironhack's database.
* Clean the data and create the aggregates as you consider.
* Create the tables in your local database.
* Populate them with your process.

In [1]:
# your code here
# your code here
import pandas as pd
from sqlalchemy import create_engine
driver   = 'mysql+pymysql:'
user     = 'data-students'
password = 'iR0nH@cK-D4T4B4S3'
ip       = '34.65.10.136'
database = 'retail_sales'
connection_string = f'{driver}//{user}:{password}@{ip}/{database}'
engine = create_engine(connection_string)

In [2]:
shop = pd.read_sql('SELECT * FROM retail_sales.raw_sales', engine)
original = pd.read_sql('SELECT * FROM retail_sales.raw_sales', engine)
shop

           date  shop_id  item_id  item_price  item_cnt_day
0    2015-01-04       29     1469      1199.0           1.0
1    2015-01-04       28    21364       479.0           1.0
2    2015-01-04       28    21365       999.0           2.0
3    2015-01-04       28    22104       249.0           2.0
4    2015-01-04       28    22091       179.0           1.0
...         ...      ...      ...         ...           ...
4540 2015-01-04       15     4240      1299.0           1.0
4541 2015-01-04       14    21922        99.0           1.0
4542 2015-01-04       15     1969      3999.0           1.0
4543 2015-01-04       14    22091       179.0           1.0
4544 2015-01-04       15     1007      1199.0           1.0

[4545 rows x 5 columns]

## Check for unclean data

In [3]:
shop.describe()

           shop_id       item_id    item_price  item_cnt_day
count  4545.000000   4545.000000   4545.000000   4545.000000
mean     34.021122  11140.459406   1031.686121      1.103630
std      16.565517   6558.649572   2073.919990      0.536967
min       2.000000     30.000000      3.000000     -1.000000
25%      22.000000   4977.000000    249.000000      1.000000
50%      31.000000  11247.000000    479.000000      1.000000
75%      50.000000  16671.000000   1192.000000      1.000000
max      59.000000  22162.000000  27990.000000     10.000000

In [4]:
shop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4545 entries, 0 to 4544
Data columns (total 5 columns):
date            4545 non-null datetime64[ns]
shop_id         4545 non-null int64
item_id         4545 non-null int64
item_price      4545 non-null float64
item_cnt_day    4545 non-null float64
dtypes: datetime64[ns](1), float64(2), int64(2)
memory usage: 177.7 KB

In [5]:
shop.dtypes

date            datetime64[ns]
shop_id                  int64
item_id                  int64
item_price             float64
item_cnt_day           float64
dtype: object

In [6]:
shop.isna().sum()

date            0
shop_id         0
item_id         0
item_price      0
item_cnt_day    0
dtype: int64

In [7]:
shop[ shop['item_cnt_day'] < 0]

           date  shop_id  item_id  item_price  item_cnt_day
179  2015-01-04       35     7877     3990.00          -1.0
305  2015-01-04       25     2575     2099.00          -1.0
386  2015-01-04       21     2946      449.00          -1.0
391  2015-01-04       21     1523      799.00          -1.0
825  2015-01-04       52    16677      332.67          -1.0
899  2015-01-04       44    14652      199.00          -1.0
901  2015-01-04       44     8095      499.00          -1.0
926  2015-01-04       44     1114      299.00          -1.0
1161 2015-01-04       42     1878     2599.00          -1.0
1416 2015-01-04       19     2690     1598.00          -1.0
1694 2015-01-04       35     7877     3990.00          -1.0
1820 2015-01-04       25     2575     2099.00          -1.0
1901 2015-01-04       21     2946      449.00          -1.0
1906 2015-01-04       21     1523      799.00          -1.0
2340 2015-01-04       52    16677      332.67          -1.0
2414 2015-01-04       44    14652      199.00          -1.0
2416 2015-01-04       44     8095      499.00          -1.0
2441 2015-01-04       44     1114      299.00          -1.0
2676 2015-01-04       42     1878     2599.00          -1.0
2931 2015-01-04       19     2690     1598.00          -1.0
3209 2015-01-04       35     7877     3990.00          -1.0
3335 2015-01-04       25     2575     2099.00          -1.0
3416 2015-01-04       21     2946      449.00          -1.0
3421 2015-01-04       21     1523      799.00          -1.0
3855 2015-01-04       52    16677      332.67          -1.0
3929 2015-01-04       44    14652      199.00          -1.0
3931 2015-01-04       44     8095      499.00          -1.0
3956 2015-01-04       44     1114      299.00          -1.0
4191 2015-01-04       42     1878     2599.00          -1.0
4446 2015-01-04       19     2690     1598.00          -1.0

In [8]:
shop['item_cnt_day'] = shop['item_cnt_day'].replace({-1:0})

## Create aggregates

In [9]:
shop['aggregate_item'] = shop['item_price'] * shop['item_cnt_day']
shop

           date  shop_id  item_id  item_price  item_cnt_day  aggregate_item
0    2015-01-04       29     1469      1199.0           1.0          1199.0
1    2015-01-04       28    21364       479.0           1.0           479.0
2    2015-01-04       28    21365       999.0           2.0          1998.0
3    2015-01-04       28    22104       249.0           2.0           498.0
4    2015-01-04       28    22091       179.0           1.0           179.0
...         ...      ...      ...         ...           ...             ...
4540 2015-01-04       15     4240      1299.0           1.0          1299.0
4541 2015-01-04       14    21922        99.0           1.0            99.0
4542 2015-01-04       15     1969      3999.0           1.0          3999.0
4543 2015-01-04       14    22091       179.0           1.0           179.0
4544 2015-01-04       15     1007      1199.0           1.0          1199.0

[4545 rows x 6 columns]

In [10]:
shopaggreg = shop.groupby('shop_id').agg({'aggregate_item':'sum'})
shopaggreg.sort_values(by = 'aggregate_item', ascending = False)

         aggregate_item
shop_id
42            337908.00
31            304692.00
12            295173.00
25            294729.00
21            232743.00
57            226269.00
37            220500.00
28            202512.00
27            172959.00
55            170847.60
22            150717.00
58            142863.00
50            142053.00
44            140436.00
6             138678.00
54            125343.00
15            125139.00
16            121923.00
26            120462.00
59            113109.00
2             103746.00
46             93903.00
29             85737.00
45             82350.00
47             80142.00
35             77739.00
38             73482.00
3              67443.00
52             64529.01
14             57450.00
24             56955.00
19             56214.00
56             54906.00
7              52371.00
53             50505.00
41             36840.00
18             35787.00
49             35784.00
39             34686.00
5              33138.00
48             32745.00
4              29361.00
10             22716.00
34             12117.00
51             10665.00

In [11]:
itemaggreg = shop.groupby('item_id').agg({'aggregate_item':'sum'})
itemaggreg.sort_values(by = 'aggregate_item', ascending = False)

         aggregate_item
item_id
1969           262134.0
6675           242910.0
1971           121473.0
1970           107988.0
13494           89940.0
...                 ...
16677               0.0
1523                0.0
8095                0.0
2946                0.0
7877                0.0

[985 rows x 1 columns]

## Export the aggregates as tables

In [12]:
driver   = 'mysql+pymysql:'
user     = 'root'
password = '<new-password>'
ip       = '127.0.0.1'
database = 'retail_sales'
connection_string = f'{driver}//{user}:{password}@{ip}/{database}'
engine = create_engine(connection_string)

In [13]:
shopaggreg.to_sql('shop_aggregated', con=engine, if_exists='replace')

In [14]:
itemaggreg.to_sql('item_aggregated', con=engine, if_exists='replace')